/*package main.java.by.academy.training.arrays;

public class task6 {
 //Имеется гирлянда, состоящая из 32 лампочек. Каждая лампочка имеет два состояния - включена или выключена.
    // В начале работы программы случайным образом задайте какие лампочки будут включены. Напишите следующие методы:
    //
    //метод blink, который будет мигать лампочками гирлянды один раз (операция ~);
    //метод run, который будет запускать гирлянду в режим бегущей строки (операция << или >>);
    //метод isFirstLampOn, который будет выяснять включена ли лампочка в первой позиции (наложение маски с помощью &);
    //метод, который будет распечатывать текущее состояние гирлянды. Для получения двоичного формата числа используйте метод Integer.toBinaryString(a).
    //Используйте побитовые операции.
    //Реализовать задачу с гирляндой используя массивы.
    //Для реализации бегущей строки используйте метод System.arraycopy(...);
    public static void main (String [] args) {
        char [][] chArray = new char [][]
                {{'a', '1'}, {'b', '2'}, {'c','3'}, {'d', '4'}} ;

        for (int i = 0; i < chArray.length; i++){
            for (int j = 0; j < chArray[0].length; j++) {
                System.out.print(" " + chArray[i][j] + " ");
            }
            System.out.println();
        }
    }
}
 */
