package main.java.by.academy.training.arrays;

public class Task2 {
    //Создать массив типа double с размером 4.
    // Записать в него любые значения с помощью блока для инициализации.
    // Вывести на консоль значение первого элемента.
    public static void main (String [] args) {
        double [] doubleArray = new double[]{10.69, 51, 8.09, 4};
        System.out.println("The first component is " + doubleArray[0]);
    }
}

